In [1]:
import pandas as pd
import numpy as np

## The Bad Way

In [3]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [4]:
pop[("California",2010):("Texas",2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [8]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

## The Better Way: Pandas MultiIndex

In [10]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [11]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [12]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [13]:
## MultiIndex as Extra Dimension

In [15]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [17]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [18]:
pop_df = pd.DataFrame({"total":pop,
                      "under18": [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [19]:
f_u18 = pop_df["under18"] / pop_df["total"]
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

# Methods of MultiIndex Creation

In [21]:
df = pd.DataFrame(np.random.rand(4, 2),
                 index=[["a","a","b","b"],[1,2,1,2]],
                 columns = ["data1","data2"])
df

        data1     data2
a 1  0.287316  0.137206
  2  0.748847  0.811355
b 1  0.903792  0.614435
  2  0.737319  0.640147

In [22]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

## Explicit MultiIndex Constructors

In [25]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [26]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [27]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

## MultiIndex Level Names

In [28]:
pop.index.names = ["state","year"]

In [29]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## MultiIndex for Columns

In [33]:
# hierarchical idices and columns
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],
                                  names = ["year","visit"])


columns = pd.MultiIndex.from_product([["Bob","Guido","Sue"],["HR","Temp"]],
                                    names = ["subject","type"])
# moc some data
data = np.round(np.random.randn(4,6),1)
data[:, ::2] *= 10
data += 37

#create the DataFrame
health_data = pd.DataFrame(data, index = index, columns = columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      38.0  37.4  39.0  37.9  32.0  36.8
     2      30.0  36.7  38.0  37.2  64.0  35.3
2014 1       5.0  39.3  28.0  36.8  34.0  34.0
     2      44.0  39.4  52.0  36.1  27.0  36.5

In [34]:
health_data["Guido"]

type          HR  Temp
year visit
2013 1      39.0  37.9
     2      38.0  37.2
2014 1      28.0  36.8
     2      52.0  36.1

# Indexing and Slicing a MultiIndex

## Multiply Indexed Series

In [35]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [36]:
pop["California",2000]

33871648

In [37]:
pop["California"]

year
2000    33871648
2010    37253956
dtype: int64

In [38]:
pop.loc["California":"New York"]

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [39]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [41]:
pop[pop>2000]

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## Multiply Indexed DataFrames

In [43]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      38.0  37.4  39.0  37.9  32.0  36.8
     2      30.0  36.7  38.0  37.2  64.0  35.3
2014 1       5.0  39.3  28.0  36.8  34.0  34.0
     2      44.0  39.4  52.0  36.1  27.0  36.5

In [44]:
health_data["Guido","HR"]

year  visit
2013  1        39.0
      2        38.0
2014  1        28.0
      2        52.0
Name: (Guido, HR), dtype: float64

In [46]:
health_data.loc[:,("Bob","HR")]

year  visit
2013  1        38.0
      2        30.0
2014  1         5.0
      2        44.0
Name: (Bob, HR), dtype: float64

# Rearranging Multi-Indices

### Sorted and UnSorted Indices

In [48]:
index = pd.MultiIndex.from_product([["a","c","b"],[1,2]])
data = pd.Series(np.random.rand(6), index = index)
data.index.names = ["char","int"]
data

char  int
a     1      0.994821
      2      0.581065
c     1      0.531025
      2      0.275534
b     1      0.067469
      2      0.582737
dtype: float64

In [49]:
try:
    data["a","b"]
except KeyError as e:
    print(type(e))
    print(e)

<class 'KeyError'>
('a', 'b')

In [50]:
data = data.sort_index()

In [51]:
data

char  int
a     1      0.994821
      2      0.581065
b     1      0.067469
      2      0.582737
c     1      0.531025
      2      0.275534
dtype: float64

In [52]:
data["a":"b"]

char  int
a     1      0.994821
      2      0.581065
b     1      0.067469
      2      0.582737
dtype: float64

## Stacking and Unstacking Indices

In [54]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [55]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [57]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [58]:
pop_flat = pop.reset_index(name = "population")
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [61]:
pop_flat.set_index(["state","year"])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

# Data Aggregations on Multi-Indices

In [62]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      38.0  37.4  39.0  37.9  32.0  36.8
     2      30.0  36.7  38.0  37.2  64.0  35.3
2014 1       5.0  39.3  28.0  36.8  34.0  34.0
     2      44.0  39.4  52.0  36.1  27.0  36.5

In [63]:
data_mean = health_data.mean(level="year")
data_mean

C:\Users\User\AppData\Local\Temp\ipykernel_12468\395314522.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean = health_data.mean(level="year")

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     34.0  37.05  38.5  37.55  48.0  36.05
2014     24.5  39.35  40.0  36.45  30.5  35.25

In [64]:
data_mean.mean(axis = 1,level = "type")

C:\Users\User\AppData\Local\Temp\ipykernel_12468\487227842.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean.mean(axis = 1,level = "type")

type         HR       Temp
year
2013  40.166667  36.883333
2014  31.666667  37.016667